Словарь/src/Catalogs/Канджи/Канджи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Канджи</name>
  <attributes>
    <name>Юникод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮникодПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеЗначение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Чтения</name>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>CatalogRef.ЧтенияКанджи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЧтения</name>
      <type>
        <types>EnumRef.ВидыЧтенийКанджи</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Словарь/src/Enums/ВидыЧтенийКанджи/ВидыЧтенийКанджи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЧтенийКанджи</name>
  <enumValues>
    <name>Онное</name>
  </enumValues>
  <enumValues>
    <name>Кунное</name>
  </enumValues>
</mdclass:Enum>

Словарь/src/Catalogs/Канджи/Forms/ФормаТаблицы/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьТаблицы();
	ИнициализацияТаблицыНаФорме();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицы()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Канджи.Ссылка КАК Ссылка,
	|	Канджи.Код КАК Код,
	|	Канджи.Наименование КАК Наименование,
	|	Канджи.ОсновноеЗначение КАК ОсновноеЗначение,
	|	Канджи.ЮникодПредставление КАК Представление
	|ИЗ
	|	Справочник.Канджи КАК Канджи
	|ГДЕ
	|	Канджи.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаКанджи.Загрузить(РезультатЗапроса.Выгрузить());
	Для Счет = 0 По ТаблицаКанджи.Количество() - 1 Цикл
		
		ТаблицаКанджи[Счет].Идентификатор = Формат(Счет, "ЧГ=");
		
	КонецЦикла;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КанджиЧтения.Ссылка КАК Канджи,
	|	КанджиЧтения.Чтение.Наименование КАК Наименование,
	|	КанджиЧтения.Чтение.ЗаписьКаной КАК ЗаписьКаной,
	|	КанджиЧтения.ВидЧтения КАК ВидЧтения
	|ИЗ
	|	Справочник.Канджи.Чтения КАК КанджиЧтения
	|
	|УПОРЯДОЧИТЬ ПО
	|	КанджиЧтения.НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	ЧтенияКанджи.Загрузить(РезультатЗапроса.Выгрузить());
КонецПроцедуры

// В процедуре ПриСозданииНаСервере или другом месте инициализации
&НаСервере
Процедура ИнициализацияТаблицыНаФорме()
	
	Если ТаблицаКанджи.Количество() = 0 Тогда
		HTMLДокумент = "<html><body><div style='padding:20px;'>Нет данных</div></body></html>";
		Возврат;
	КонецЕсли;
	
	КлючНастройкиКлиентскогоПриложения = "Общее/НастройкиКлиентскогоПриложения";
	Настройка = ХранилищеСистемныхНастроек.Загрузить(КлючНастройкиКлиентскогоПриложения);
	СветлаяТема = Настройка.ТемаКлиентскогоПриложения = ТемаКлиентскогоПриложения.Светлая;
	
	// Используем ЗаписьXML для производительности
	ПостроительHTML = Новый ЗаписьXML;
	ПостроительHTML.УстановитьСтроку();
	
	// Шапка документа со стилями
	ПостроительHTML.ЗаписатьБезОбработки(ПолучитьШапкуHTML(СветлаяТема));
	
	// Основной контейнер для карточек
	ПостроительHTML.ЗаписатьБезОбработки("<div class='cards-container'>");
	
	// Формируем карточки
	Для Каждого Строка Из ТаблицаКанджи Цикл
		
		// Экранируем HTML-спецсимволы
		НаименованиеЭск = ЭкранироватьHTML(Строка.Наименование);
		ЗначениеЭск = ЭкранироватьHTML(Строка.ОсновноеЗначение);
		Если СтрДлина(ЗначениеЭск) > 100 Тогда
			ЗначениеЭск = Лев(ЗначениеЭск, 97) + "...";
		КонецЕсли;
		
		ЗначениеЭск = СтрЗаменить(ЗначениеЭск, Символы.ПС, "<br>");
		КодЭск = ЭкранироватьHTML(Строка.Код);
		
		HTMLЧтений = "<div class='card-readings'><table class='readings-table'>";
		Отбор = Новый Структура("Канджи", Строка.Ссылка);
		Чтения = ЧтенияКанджи.НайтиСтроки(Отбор);
		Счет = 0;
		Для Каждого Чтение Из Чтения Цикл
			
			ЧтениеНаименованиеЭск = ЭкранироватьHTML(Чтение.Наименование);
			ВидЧтения = ?(Чтение.ВидЧтения = Перечисления.ВидыЧтенийКанджи.Кунное, "кун.", "он.");
			HTMLЧтений = HTMLЧтений + 
			"<tr class='readings-row'>" +
			"<td class='readings-type'>" + ВидЧтения + "</td>" +
			"<td class='readings-name'>" + ЧтениеНаименованиеЭск + "</td>" +
			"</tr>";
			
			Счет = Счет + 1;
			Если Счет = 2 Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		HTMLЧтений = HTMLЧтений + "</table></div>";
		
		HTMLКарточки = "
		|<div class='card' id ='" + Строка.Идентификатор + "'>
		|    <div class='card-code'>" + КодЭск + "</div>
		|    <div class='card-header'>
		|        <div class='card-symbol'>" + Строка.Представление + "</div>
		|        <div style='flex-grow:1; display:flex; flex-direction:column; overflow-y:auto;'>
		|            <div class='card-title'>" + НаименованиеЭск + "</div>
		|            " + HTMLЧтений + "
		|        </div>
		|    </div>
		|    <div class='card-value'>" + ЗначениеЭск + "</div>
		|</div>";
		
		ПостроительHTML.ЗаписатьБезОбработки(HTMLКарточки);
		
		
	КонецЦикла;
	
	ПостроительHTML.ЗаписатьБезОбработки("</div></body></html>");
	
	HTMLДокумент = ПостроительHTML.Закрыть();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьШапкуHTML(ЭтоСветлаяТема)
	
	Если ЭтоСветлаяТема Тогда
	    ЦветФона = "#f5f5f5";
	    ЦветФонаКарточки = "white";
	    ЦветТекстаЗаголовка = "#333";
	    ЦветЧтений = "#888888";
	    ЦветТекстаЗначения = "#444";
	    ЦветКода = "#999999";
	    ЦветГраницы = "#ddd";
	    ЦветТени = "rgba(0,0,0,0.15)";
	    ЦветФонаТаблички = "rgba(240, 240, 240, 0.7)";
	    ЦветГраницыТаблички = "rgba(200, 200, 200, 0.5)";
	Иначе
	    // Темная тема
	    ЦветФона = "#1e1e1e";
	    ЦветФонаКарточки = "#252526";
	    ЦветТекстаЗаголовка = "#ffffff";
	    ЦветЧтений = "#777777";
	    ЦветТекстаЗначения = "#999999";
	    ЦветКода = "#777777";
	    ЦветГраницы = "#3e3e42";
	    ЦветТени = "rgba(0,0,0,0.7)";
	    ЦветФонаТаблички = "rgba(60, 60, 60, 0.5)";
	    ЦветГраницыТаблички = "rgba(80, 80, 80, 0.5)";
	КонецЕсли;
	
	Шаблон = "
	|<!DOCTYPE html>
	|<html>
	|<head>
	|    <meta charset='UTF-8'>
	|    <meta http-equiv='X-UA-Compatible' content='IE=10'>
	|    <style>
	|        * {
	|            margin: 0;
	|            padding: 0;
	|            box-sizing: border-box;
	|        }
	|        
	|        body {
	|            font-family: Arial, sans-serif;
	|            background-color: &ЦветФона;
	|            padding: 10px;
	|        }
	|        
	|        .cards-container {
	|            display: grid;
	|            grid-template-columns: repeat(auto-fill, minmax(220px, 1fr));
	|            gap: 15px;
	|            width: 100%;
	|        }
	|        
	|        .card {
	|            background: &ЦветФонаКарточки;
	|            border: 1px solid &ЦветГраницы;
	|            border-radius: 8px;
	|            padding: 10px;
	|            height: 180px;
	|            display: flex;
	|            flex-direction: column;
	|            position: relative;
	|            overflow: hidden;
	|            cursor: pointer;
	|            transition: all 0.3s ease;
	|        }
	|        
	|        .card-code {
	|            position: absolute;
	|            top: 8px;
	|            right: 8px;
	|            font-size: 10px;
	|            color: &ЦветКода;
	|            opacity: 0.7;
	|            z-index: 1;
	|        }
	|        
	|        .card:hover {
	|            box-shadow: 0 4px 12px &ЦветТени;
	|            transform: translateY(-2px);
	|        }
	|        
	|        .card-header {
	|            display: flex;
	|            align-items: flex-start;
	|            flex-shrink: 0;
	|            flex-basis: 70%;
	|            min-height: 70%;
	|            max-height: 70%;
	|            overflow-y: auto;
	|        }
	|        
	|        .card-symbol {
	|            font-size: 70px;
	|            font-weight: bold;
	|            margin-right: 15px;
	|            line-height: 1;
	|            min-width: 50px;
	|            text-align: center;
	|            flex-shrink: 0;
	|        }
	|        
	|        .card-title {
	|            font-size: 20px;
	|            font-weight: bold;
	|            color: &ЦветТекстаЗаголовка;
	|            flex-grow: 1;
	|            word-break: break-word;
	|            margin-bottom: 4px;
	|        }
	|        
	|        .readings-table {
	|            border-collapse: collapse;
	|            width: 100%;
	|            background-color: &ЦветФонаТаблички;
	|            border-radius: 4px;
	|            overflow: hidden;
	|            border: 1px solid &ЦветГраницыТаблички;
	|        }
	|        
	|        .readings-row {
	|            border-bottom: 1px solid &ЦветГраницыТаблички;
	|        }
	|        
	|        .readings-row:last-child {
	|            border-bottom: none;
	|        }
	|        
	|        .readings-name {
	|            padding: 2px 4px 2px 2px;
	|            text-align: left;
	|            vertical-align: middle;
	|            font-size: 13px;
	|            white-space: nowrap;
	|            width: 75%;
	|            color: &ЦветЧтений;
	|        }
	|        
	|        .readings-type {
	|            padding: 2px 2px 2px 4px;
	|            text-align: center;
	|            vertical-align: middle;
	|            font-size: 11px;
	|            white-space: nowrap;
	|            width: 25%;
	|            font-weight: bold;
	|            color: &ЦветЧтений;
	|        }
	|        
	|        .card-value {
	|            flex-grow: 1;
	|            font-size: 15px;
	|            color: &ЦветТекстаЗначения;
	|            padding: 8px 0 4px 0;
	|            border-top: 1px solid &ЦветГраницы;
	|            word-break: break-word;
	|            overflow-y: auto;
	|            max-height: none;
	|            white-space: pre-line;
	|            display: -webkit-box;
	|             -webkit-line-clamp: 3;
	|             -webkit-box-orient: vertical;
	|            overflow: hidden;
	|            margin-top: auto;
	|        }
	|    </style>
	|</head>
	|<body>";
	
	// Заменяем параметры
	Шаблон = СтрЗаменить(Шаблон, "&ЦветФона", ЦветФона);
	Шаблон = СтрЗаменить(Шаблон, "&ЦветФонаКарточки", ЦветФонаКарточки);
	Шаблон = СтрЗаменить(Шаблон, "&ЦветТекстаЗаголовка", ЦветТекстаЗаголовка);
	Шаблон = СтрЗаменить(Шаблон, "&ЦветЧтений", ЦветЧтений);
	Шаблон = СтрЗаменить(Шаблон, "&ЦветТекстаЗначения", ЦветТекстаЗначения);
	Шаблон = СтрЗаменить(Шаблон, "&ЦветГраницы", ЦветГраницы);
	Шаблон = СтрЗаменить(Шаблон, "&ЦветТени", ЦветТени);
	Шаблон = СтрЗаменить(Шаблон, "&ЦветФонаТаблички", ЦветФонаТаблички);
	Шаблон = СтрЗаменить(Шаблон, "&ЦветГраницыТаблички", ЦветГраницыТаблички);
	
	Возврат Шаблон;
КонецФункции

&НаСервере
Функция ЭкранироватьHTML(Текст)
	
	Если Текст = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Текст = СтрЗаменить(Текст, "&", "&amp;");
	Текст = СтрЗаменить(Текст, "<", "&lt;");
	Текст = СтрЗаменить(Текст, ">", "&gt;");
	Текст = СтрЗаменить(Текст, """", "&quot;");
	Текст = СтрЗаменить(Текст, "'", "&#39;");
	
	Возврат Текст;
	
КонецФункции

&НаКлиенте
Процедура HTMLДокументПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	ТекЭлемент = ДанныеСобытия.Element;
	Если ТекЭлемент = Неопределено ИЛИ ТекЭлемент.classname = "" Тогда
		Возврат;
	КонецЕсли;
	
	Пока ТекЭлемент.parentelement <> Неопределено Цикл
		Если ТекЭлемент.classname = "card" Тогда
			Прервать;
		КонецЕсли;
		ТекЭлемент = ТекЭлемент.parentelement;
	КонецЦикла;
	Если ТекЭлемент.classname <> "card" Тогда
		Возврат;
	КонецЕсли;
	
	Канджи = ТаблицаКанджи.НайтиСтроки(Новый Структура("Идентификатор", ТекЭлемент.id));
	Если Канджи.Количество() Тогда
		
		КлючОткрытия = Канджи[0].Ссылка;
		ПараметрыФормы = Новый Структура("Ключ", КлючОткрытия);
		ОписаниеЗакрытия = Новый ОписаниеОповещения("ПриЗакрытииКанджи", ЭтотОбъект);
		ОткрытьФорму("Справочник.Канджи.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма, , , ,ОписаниеЗакрытия);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииКанджи(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	ЗаполнитьТаблицы();
	ИнициализацияТаблицыНаФорме();
	
КонецПроцедуры
